-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 17, 2026 at 06:36 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `museum_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `artworks`
--
DROP TABLE IF EXISTS `artworks`;
CREATE TABLE `artworks` (
  `id` varchar(50) NOT NULL,
  `title` varchar(255) NOT NULL,
  `artist` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `image_url` varchar(500) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `artworks`
--

INSERT INTO `artworks` (`id`, `title`, `artist`, `description`, `image_url`) VALUES
('001', 'Repose', 'John White Alexander', 'ภาพวาดหุ่นมนุษย์เป็นรูปหญิงสาวในท่าทางที่สง่างามภายในห้องที่ตกแต่งอย่างหรูหรา ในองค์ประกอบภาพที่โดดเด่นนี้ สีหน้าที่ดูเย้ายวนและเส้นสายที่อ่อนช้อยของนางแบบสะท้อนถึงรสนิยมของชาวฝรั่งเศสในยุคนั้นที่นิยมภาพลักษณ์สตรีที่ดูงดงามและมีเสน่ห์ทางเพศ นอกจากนี้การจัดวางองค์ประกอบที่กล้าหาญยังสื่อถึงจังหวะของเส้นสายที่พริ้วไหวตามสไตล์ Art Nouveau ซึ่งเป็นรูปแบบศิลปะที่โดดเด่นในงานนิทรรศการปารีส', 'https://collectionapi.metmuseum.org/api/collection/v1/iiif/10065/33683/main-image'),
('002', 'Fur Traders Descending the Missouri', 'George Caleb Bingham', 'ภาพวาดแนวชีวิตประจำวันที่มีเอกลักษณ์โดดเด่นและแทบไม่มีต้นแบบมาก่อนในผลงานยุคนั้น โดยเดิมทีศิลปินตั้งชื่อภาพนี้ว่า \"French Trader & Half breed Son\" ก่อนที่จะถูกเปลี่ยนชื่อให้ดูทั่วไปและลดความขัดแย้งลงเป็น \"Fur Traders Descending the Missouri\" เพื่อการประชาสัมพันธ์ศิลปะอเมริกันในระดับชาติผ่านภาพพิมพ์ ภายในภาพถ่ายทอดฉากอันเงียบสงบพร้อมบรรยากาศที่สว่างไสวเรืองรอง ซึ่งเป็นการนำเสนอภาพลักษณ์ในอุดมคติของดินแดนชายขอบอเมริกา (American frontier) เพื่อตอบสนองความชื่นชมของผู้ชมแถบชายฝั่งตะวันออก โดยถือเป็นผลงานชิ้นสำคัญที่สะท้อนถึงวิถีชีวิตและการค้าขายในลุ่มแม่น้ำมิสซูรียุคนั้นได้อย่างงดงาม', 'https://collectionapi.metmuseum.org/api/collection/v1/iiif/10159/34338/main-image'),
('003', 'Daniel Crommelin Verplanck', 'John Singleton Copley', 'Daniel Crommelin Verplanck ในวัยเก้าขวบผู้เป็นทายาทของตระกูลลูกครึ่งดัตช์-อเมริกันผู้มั่งคั่ง ถูกนำเสนอผ่านภาพพอร์ตเทรตที่มีความละเอียดลออและชัดเจนอันเป็นเอกลักษณ์ที่ทำให้ Copley กลายเป็นจิตรกรที่ประสบความสำเร็จที่สุดในกลุ่มชนชั้นสูงของอเมริกาช่วงยุคอาณานิคม โดยในภาพนี้ศิลปินได้นำเสนอหัวข้อยอดนิยมในสมัยนั้นคือภาพเด็กชายคู่กับกระรอกสัตว์เลี้ยงที่ถูกฝึกมาอย่างดีพร้อมสายจูงสีทอง ซึ่งเป็นสัญลักษณ์สื่อถึงความอดทนและความอุตสาหะของเจ้าของที่มีฐานะร่ำรวย โดยองค์ประกอบของภาพที่จัดวางให้ตัวแบบนั่งอยู่ ณ บ้านพักตระกูล Mount Gulian ในแถบ Hudson Valley ช่วยสะท้อนถึงสถานะทางสังคมและภูมิหลังที่สง่างามของเด็กชายผู้ซึ่งในกาลต่อมาได้กลายเป็นสมาชิกพรรควิกในสภาครองเกรสของสหรัฐอเมริกา', 'https://collectionapi.metmuseum.org/api/collection/v1/iiif/10522/34316/main-image'),
('004', 'Flight Into Egypt', 'Henry Ossawa Tanner', 'ผลงานภาพร่างที่มีสีสันสดใสชิ้นนี้เป็นผลงานของ Henry Ossawa Tanner ศิลปินชาวแอฟริกันอเมริกันผู้มีชื่อเสียงในช่วงต้นศตวรรษที่ 20 ในช่วงกลางทศวรรษ 1890 ศิลปินได้หันมาสร้างสรรค์งานในธีมศาสนาซึ่งเป็นสิ่งที่เขาคุ้นเคยมาตั้งแต่เด็กเนื่องจากบิดาเป็นบิชอปในคริสตจักร โดยภาพนี้ถูกถ่ายทอดด้วยสไตล์ที่เน้นความรู้สึกและบรรยากาศอันเป็นเอกลักษณ์ของ Tanner ผู้ซึ่งเลือกใช้ชีวิตและศึกษาศิลปะในฝรั่งเศสเพื่อหลีกหนีจากปัญหาการเหยียดเชื้อชาติในสหรัฐอเมริกาเพื่อให้สามารถมุ่งมั่นกับการสร้างสรรค์ผลงานได้อย่างเต็มที่', 'https://collectionapi.metmuseum.org/api/collection/v1/iiif/16947/2216155/restricted'),
('005', 'Approaching Thunder Storm', 'Martin Johnson Heade', 'Approaching Thunder Storm เป็นหนึ่งในผลงานยุคแรกของซีรีส์ภาพวาดพายุริมฝั่งทะเลที่ Heade สร้างสรรค์ขึ้นโดยอ้างอิงจากภาพร่างเหตุการณ์จริงที่เขาได้เห็นบริเวณอ่าว Narragansett ในโรดไอแลนด์ช่วงปี 1858 ซึ่งความโดดเด่นของภาพนี้อยู่ที่การที่ศิลปินเลือกปฏิเสธขนบการวาดภาพพายุที่โหมกระหน่ำอย่างรุนแรง แต่กลับเลือกถ่ายทอดช่วงเวลาแห่งการเฝ้ารอและความเงียบงันอันน่าพรั่นพรึงภายใต้ท้องฟ้าที่กำลังมืดมิดและผืนดินที่สว่างไสวอย่างประหลาดแทน โดยภาพนี้สามารถจับบรรยากาศความตึงเครียดก่อนพายุจะมาถึงได้อย่างชัดเจนและมีชีวิตชีวา', 'https://collectionapi.metmuseum.org/api/collection/v1/iiif/11050/46452/main-image'),
('006', 'Lake George', 'John Frederick Kensett', 'Lake George เป็นผลงานขนาดใหญ่ที่สุดจากการศึกษาและมาเยือนพื้นที่แถบภูเขา Adirondack ของ Kensett โดยศิลปินเลือกที่จะไม่นำเสนอภาพความเจริญทางพาณิชย์และการขยายตัวของรถไฟที่กำลังเกิดขึ้นรอบทะเลสาบในขณะนั้น แต่กลับมุ่งเน้นไปที่ทัศนียภาพอันเงียบสงบจากบริเวณ Homer Point ที่มองออกไปยัง Black Mountain แทน ซึ่งในภาพนี้มีการใช้จานสีที่จำกัดและองค์ประกอบภาพที่เรียบง่ายเพื่อถ่ายทอดความงามอันสงบนิ่งของสถานที่ซึ่งกำลังเปลี่ยนแปลงไปอย่างรวดเร็ว โดยถือเป็นภาพวาดที่สะท้อนถึงสุนทรียภาพทางธรรมชาติในอุดมคติท่ามกลางกระแสความนิยมของเหล่าศิลปินและนักท่องเที่ยวในยุคคริสต์ศตวรรษที่ 19 ได้อย่างยอดเยี่ยม', 'https://collectionapi.metmuseum.org/api/collection/v1/iiif/11311/34368/main-image'),
('007', 'In the Generalife', 'John Singer Sargent', 'In the Generalife เป็นผลงานที่แสดงให้เห็นถึงความเชี่ยวชาญของ Sargent ในการผสมผสานทักษะจิตรกรภาพพอร์ตเทรตและการวาดภาพกลางแจ้ง (Plein-air) เข้าด้วยกันอย่างน่าดึงดูดใจ โดยเขาได้ถ่ายทอดบรรยากาศภายในสวนของพระราชวังฤดูร้อนอดีตสุลต่านมัวร์ ณ เมืองกรานาดา ประเทศสเปน ท่ามกลางแมกไม้อันเขียวชอุ่มและทางเดินที่ปูด้วยกระเบื้อง ซึ่งในภาพประกอบด้วย Emily น้องสาวของเขาที่กำลังนั่งวาดภาพอยู่ที่ขาตั้ง พร้อมด้วย Jane de Glehn ศิลปินเพื่อนร่วมเดินทาง และ Dolores Carmona เพื่อนชาวสเปนที่กำลังยืนเฝ้าดูอยู่ โดยภาพลักษณ์ของเพื่อนและญาติมิตรที่กำลังทำงานศิลปะท่ามกลางธรรมชาติเช่นนี้ ถือเป็นหนึ่งในรูปแบบผลงานที่โดดเด่นและมีเสน่ห์ที่สุดในชุดผลงานของเขา', 'https://collectionapi.metmuseum.org/api/collection/v1/iiif/12116/1364774/restricted'),
('008', 'Ernesta (Child with Nurse)', 'Cecilia Beaux', 'Ernesta (Child with Nurse) เป็นผลงานที่โดดเด่นด้วยการจัดองค์ประกอบภาพที่เฉียบคมและการใช้ฝีแปรงที่อิสระซึ่งสะท้อนถึงอิทธิพลจากศิลปินกลุ่มอิมเพรสชันนิสต์ โดยแสดงภาพของ Ernesta Drinker หลานสาววัยสองขวบของศิลปินที่กำลังกำมือ Mattie ผู้เป็นพี่เลี้ยงซึ่งถูกตัดทอนองค์ประกอบภาพเหลือเพียงครึ่งตัวอย่างกล้าหาญ ภาพนี้ถ่ายทอดความสง่างามและความเปราะบางของเด็กน้อยในคราวเดียวกันขณะก้าวเดินบนพื้นขัดเงาอันกว้างขวาง โดยมีมือของพี่เลี้ยงทำหน้าที่เป็นสัญลักษณ์สากลของความคุ้มครองและความปลอดภัย นอกจากนี้ขนาดของผ้ากันเปื้อนที่กว้างใหญ่ยังช่วยเน้นให้เห็นถึงความตัวเล็กของเด็กหญิงได้ชัดเจนยิ่งขึ้น ซึ่งองค์ประกอบและการจัดวางท่าทางในลักษณะนี้ทำให้ตัวละครดูมีความสำคัญและสง่างามราวกับภาพวาดราชนิกุลตัวน้อยในอดีต', 'https://collectionapi.metmuseum.org/api/collection/v1/iiif/10127/35311/restricted'),
('009', 'The Rocky Mountains, Lander\'s Peak', 'Albert Bierstadt', 'The Rocky Mountains, Lander\'s Peak เป็นผลงานที่ถ่ายทอดทัศนียภาพอันยิ่งใหญ่ของเทือกเขาร็อกกีในเขตไวยอมิง ซึ่งศิลปินได้สร้างสรรค์ขึ้นภายหลังจากที่เขาได้ร่วมเดินทางไปกับคณะสำรวจของรัฐบาล โดยภาพวาดนี้ทำหน้าที่เสมือนการโฆษณาดินแดนชายขอบว่าเป็นพื้นที่ที่ถูกกำหนดไว้สำหรับผู้ตั้งถิ่นฐานชาวผิวขาวตามความเชื่อเรื่องโชคชะตาที่ฟ้าลิขิต (Manifest Destiny) ซึ่งเป็นความเชื่อที่อ้างสิทธิในการครอบครองดินแดนทั่วทวีปและละเลยการดำรงอยู่ของกลุ่มประชากรพื้นเมืองไปอย่างเป็นระบบ โดยในส่วนหน้าของภาพมีการแสดงภาพของชาวโชโชนี (Shoshone) ท่ามกลางบรรยากาศทางธรรมชาติที่ดูตระการตาและสมบูรณ์แบบเพื่อนำเสนอภาพลักษณ์ของดินแดนใหม่ที่มีความสำคัญทั้งในเชิงศิลปะและการเมืองของสหรัฐอเมริกาในยุคนั้น', 'https://collectionapi.metmuseum.org/api/collection/v1/iiif/10154/34358/main-image'),
('010', 'Lydia Crocheting in the Garden at Marly', 'Mary Cassatt', 'Lydia Crocheting in the Garden at Marly เป็นผลงานที่แสดงภาพของ Lydia พี่สาวของศิลปินที่กำลังจดจ่ออยู่กับการถักโครเชต์ ซึ่งเป็นงานฝีมือแบบโบราณที่เหล่าผู้มั่งคั่งในยุคนั้นให้ความสำคัญท่ามกลางยุคสมัยแห่งการใช้แรงงานเครื่องจักร โดยตัวละครถูกถ่ายทอดในชุดที่ดูหรูหราทันสมัยแต่ดูขัดแย้งกับสภาพแวดล้อมที่เป็นสวนในกำแพง ณ เมืองมาร์ลี-เลอ-รัว นอกกรุงปารีส ภาพวาดนี้ยังแสดงให้เห็นถึงความสำเร็จของ Cassatt ในการทดลองวาดภาพกลางแจ้ง (Plein-air) ที่สามารถจับแสงแดดอันเจิดจ้าได้อย่างมีประสิทธิภาพตามแนวทางของกลุ่มศิลปินอิมเพรสชันนิสต์ฝรั่งเศส ผ่านการจัดองค์ประกอบภาพที่ดูมีพลังและมีชีวิตชีวาซึ่งสะท้อนถึงวิถีชีวิตในครัวเรือนท่ามกลางธรรมชาติอันสวยงาม', 'https://collectionapi.metmuseum.org/api/collection/v1/iiif/10393/35817/restricted');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `artworks`
--
ALTER TABLE `artworks`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
